import sys
import json
import os
BASE = os.path.dirname(os.path.abspath(__file__))
FILE_DICTIONARY = 'answers.json'

QUESTIONS = {
    r'^почему.*':[
        r'потому что',
    ],
    r'^зачем.*':[
        'затем что',
    ],
    r'^когда.*':[
        'когда .*ет',
    ],
    r'^кого.*':[
        'тебя.?$',
        'его.?$',
        '\b.*ну',
    ],
    r'^кому.*':[
        r'ему.?$',
        r'ей.?$',
        r'мне.?$'
    ],
    r'^как тебе':[
        r'не оч.*',
        r'очень.+',
        r'весьма'
    ],
    r'.*ила':[
        r'.*зачем .*ила.*',
    ],
    r'пиздец':[
        r'^[А-Яа-я]*ец',
    ],
    r'блять':[
        r'спокой',
    ],
    r'.*хочу (.*)ться\b': [
        r'палец.*в.*во',
        r'весьма.+',
        r'очень.*'
    ],
    r'.*ся$':[
        r'мило',
        r'а я .*',
    ],
    r'нравится':[
        r'как .*к\b',
    ],
    r'кот.*':[
        r'сорок\b',
    ],
    r'кош.*':[
        r'\bнезависим.*',
    ],
    r'кек':[
        r'.*ао',
    ],
    r'.*ы кт.*':[
        r'.*не .*жопа.*',
    ],
    r'.*да.*':[
        r'^нет[\.,!?].*',
    ],
    r'.*нет.*':[
        r'^да[\.,!?].*',
    ],
    r'(.*здравствуй.*)|(.*прив.*)':[
        r'^добрый .*',
        r'^доброе .*',
        r'^здравствуйте.*',
        r'^привет.*',
    ],
    r'(.*как дел.*)|(.*как ты.?)|(.*ты как.*)|(.*как жизн.*)':[
        r'^как у .*',
        r'^пизд.*',
        r'хорошо.*',
        r'.*норм.*',
        r'отлич.*',
    ],
    r'(как.*зовут.*)|(.*звать.*)':[
        r'лена.*',
    ],
    r'(ч.*делаешь.*)|(ч.*маешься.*)|(.*кодишь.*)':[
        r'.*я.*аю.*',
        r'.*я.*щу.*',
        r'.*сплю.*',
    ],
    r'(.*где.*)':[
        r'^в .*е',
    ],
    r'(.*куда*.)':[
        r'в .*[ву]',
    ],
    r'.*сколько.*':[
        r'мно.*',
    ],
    r'.*кто.*':[
        r'.*не .+дело.*',
    ],
    r'.*думаю.*':[
        r'.*думаешь\?',
    ],
    r'.*думаешь.*':[
        r'.*разниц.*',
        r'.*думаю.*',
    ],
    r'.*ла$':[
        r'.*всё равно',
        r'.*дела.*нет.*',
        r'.*зачем.*мне.*это.*'
    ],
    r'^какое.*':[
        r'.*ое[\.\?!,]?$',
    ],
    r'^какая.*':[
        r'.*ая[\.\?!,]?$',
    ],
    r'^какой.*': [
        r'[^к].*ой[\.\?!,]?$',
        r'.*[^лт]ин[\.\?!,]?$',
    ],
    r'.*как.*': [
        r'^как у .*',
        r'^как в .*',
        r'^как на .*',
    ],
    r'.*какое.*':[
        r'.*такое.*',
    ],
    r'.+ чего.?':[
        r'.*этого.?'
    ],
    r'(.*что.*)|(.*чего.+)':[
        r'.*вот это вот\b.*',
        r'не знаю.?',
    ],
    r'.*пойдём.*':[
        r'.*хорошо',
        r'.*конечно.*пойдём',
    ],
    r'.*ебанулась.*':[
        r'да, я.*'
    ],
    r'(.*прикольно.*)|(.*крут.*)|(.*жж.*ш.*)|(.*молодец.*)|(.*хуя.*)|(.*огонь.*)':[
        r'^спасибо.*',
        r'^да ладно.*',
    ],
    r'(.*прикинь.*)': [
        r'.*ох.*еть',
    ],
    r'(.*пасибо.*)':[
        r'^пожалуйста.*',
        r'^обращайся.*',
    ],
    r'(^удар.*)':[
        r'^да ладно .*',
    ],
    r'(.*пока$)|(.*спок.*но.*)|(.*я.*спать.*)|(.*до.*свидан.*)':[
        r'.*спокойной.*',
        r'.*всего доброго.*',
        r'.*пока.?$',
        r'.*любим и .*жд.*м',
    ],
    r'(^ну .*)': [
        r'.*мы все тут.*',
    ],
    r'(.*аха.*)|(\bлол\b)|(.*хах.*)|(.*хех.*)': [
        r'смеш.*',
        r'забавно.*',
    ],
    r'хочешь.*': [
        r'хочу.?'
    ],
    r'х.* ли .+': [
        r'ты же .+'
    ],
    r'.*зел.н.+слон.*': [
        r'братишк'
    ]
}

if __name__ == "__main__":
    if '--help' in sys.argv:
        print("\nWith the script you can check if questions dictionary is ready to use.")
        sys.exit(0)
    try:
        # load dictionary from .json
        dictionary = json.load(open(os.path.join(BASE, FILE_DICTIONARY), 'r'))
        print("dictionary of answers is OK!")
    except FileNotFoundError:
        # make a dictionary and write in file
        print(">> file '{0}' is not found. Create new '{0}'".format(FILE_DICTIONARY))
        json.dump(QUESTIONS, open(os.path.join(BASE, FILE_DICTIONARY), 'w'))